package com.alibb.system.constant;

import lombok.Getter;

public enum ReturnCode {

    /**
     * 201-299 设备业务错误代码
     * 301-399 用户业务错误代码
     * 601-699 工单业务错误代码
     * 701-799 角色业务错误代码
     */
    RC100(100,"操作成功"),
    RC999(999,"操作失败"),
    RC201(201,"设备已经注册"),
    RC202(202,"添加设备失败"),
    RC203(203,"更新设备信息失败"),
    RC204(204,"删除设备失败"),
    RC205(205,"更改设备状态失败"),
    RC301(301,"用户名或密码错误"),
    RC302(302,"用户未登录或token过期"),
    RC303(303,"您没有访问的权限，请联系管理员授权"),
    RC304(304,"用户名已存在"),
    RC305(305,"创建用户失败"),
    RC306(306,"删除用户失败"),
    RC307(307,"更新用户信息失败"),
    RC308(308,"更改用户状态失败"),
    RC309(309,"用户已停用或用户已注销"),
    RC403(403,"参数校验错误"),
    RC500(500,"系统异常，请稍后尝试"),
    RC601(601,"新建工单失败"),
    RC602(602,"删除工单失败"),
    RC603(603,"完成工单失败"),
    RC701(701,"用户角色更新失败"),
    RC702(702,"添加角色失败"),
    RC703(703,"更新角色信息");

    @Getter
    private final int code;

    @Getter
    private final String msg;

    ReturnCode(int code, String msg) {
        this.code = code;
        this.msg = msg;
    }

}
